Repository: kraspy/ai_media_library
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: Select transcription engine.
ru: Выберите движок транскрипции.

source: Transcription Engine
ru: Движок транскрипции

source: Select LLM provider.
ru: Выберите LLM провайдера.

source: LLM Provider
ru: LLM Провайдер

source: System prompt for Summarization.
ru: Системный промпт для саммаризации.

source: Summarization Prompt
ru: Промпт для саммаризации

source: System prompt for Concept Extraction Agent.
ru: Системный промпт для саммаризации.

source: Concept Extraction Prompt
ru: Промпт для извлечения концепций

source: System prompt for Study Plan Generation Agent.
ru: Системный промпт для агента генерации учебного плана.

source: Plan Generation Prompt
ru: Промпт для генерации плана

source: System prompt for Quiz Generation Agent.
ru: Системный промпт для агента генерации квизов.

source: Quiz Generation Prompt
ru: Промпт для генерации квиза

source: System prompt for Tutor Agent.
ru: Системный промпт для агента-учителя.

source: Tutor Prompt
ru: Промпт учителя

source: Settings
ru: Настройки

source: Title
ru: Название

source: Description
ru: Описание

source: Media Item
ru: Медиафайл

source: Complexity
ru: Сложность

source: Complexity level (1-5)
ru: Уровень сложности (1-5)

source: Created At
ru: Создано

source: Concept
ru: Концепция

source: Concepts
ru: Концепции

source: User
ru: Пользователь

source: Front
ru: Лицевая сторона

source: Question or front side
ru: Вопрос или лицевая сторона

source: Back
ru: Назад

source: Answer or back side
ru: Ответ или обратная сторона

source: Repetitions
ru: Повторения

source: Number of repetitions
ru: Количество повторений

source: Interval
ru: Интервал

source: Days until next review
ru: Дней до следующего повторения

source: Ease Factor
ru: Фактор легкости

source: Easiness factor
ru: Фактор легкости

source: Last Review
ru: Последнее повторение

source: Next Review
ru: Следующее повторение

source: Flashcard
ru: Флеш-карточка

source: Flashcards
ru: Флеш-карточки

source: Active
ru: Активно

source: Completed
ru: Завершено

source: Archived
ru: Архивировано

source: Topic
ru: Тема

source: Status
ru: Статус

source: Study Plan
ru: Учебный план

source: Study Plans
ru: Учебные планы

source: Order
ru: Порядок

source: Is Completed
ru: Завершено

source: Study Unit
ru: Учебный блок

source: Study Units
ru: Учебные блоки

source: Multiple Choice
ru: Выбор ответа

source: Open Answer
ru: Открытый ответ

source: Question Data
ru: Данные вопроса

source: JSON structure with question, options, correct_answer, explanation
ru: Структура JSON с вопросом, вариантами, правильным ответом, объяснением

source: Question Type
ru: Тип вопроса

source: Quiz Question
ru: Вопрос

source: Quiz Questions
ru: Вопросы

source: Updated At
ru: Создано

source: Tutor Chat Session
ru: Выйти из сессии

source: Tutor Chat Sessions
ru: Чаты с Учителем

source: Assistant
ru: Ассистент

source: Session
ru: Выйти из сессии

source: Role
ru: Роль

source: Content
ru: Содержимое

source: Chat Message
ru: Сообщение чата

source: Chat Messages
ru: Сообщения чата

source: Parent Topic
ru: Родительская тема

source: Slug
ru: Слаг

source: Topics
ru: Темы

source: Audio
ru: Аудио

source: Video
ru: Видео

source: Image
ru: Изображение

source: Text
ru: Текст

source: Pending
ru: Ожидает

source: Processing
ru: Обработка

source: Failed
ru: Ошибка

source: File
ru: Файл

source: Media Type
ru: Тип медиа

source: Transcription
ru: Транскрипция

source: Summary
ru: Саммари (Короткое резюме)

source: Error Log
ru: Журнал ошибок

source: Stores stack traces for failed tasks.
ru: Хранит стектрейсы упавших задач.

source: Tags
ru: Теги

source: Media Items
ru: Медиафайлы

source: File "%(filename)s" has an unsupported extension: .%(ext)s
ru: Файл "%(filename)s" имеет неподдерживаемое расширение: .%(ext)s

source: File "%(filename)s" uploaded, but analysis could not be started due to an API error.
ru: Файл "%(filename)s" загружен, но анализ не удалось запустить из-за ошибки API.

source: Files uploaded successfully.
ru: Файлы успешно загружены.

source: Analysis re-started, but %(count)d items failed to schedule due to API error.
ru: Анализ перезапущен, но для %(count)d элементов не удалось запланировать задачи из-за ошибки API.

source: Analysis re-started for selected items.
ru: Перезапуск AI анализ для выбранных элементов

source: Topic created successfully.
ru: Тема успешно создана.

source: Topic updated successfully.
ru: Тема успешно обновлена.

source: Topic deleted successfully.
ru: Тема успешно удалена.

source: English
ru: Английский

source: Russian
ru: Русский

source: AI Media Library
ru: AI Медиатека

source: Home
ru: Главная

source: Admin
ru: Админка

source: Learning
ru: Обучение

source: AI Tutor
ru: AI Учитель

source: Welcome
ru: Добро пожаловать

source: Logout
ru: Выйти

source: Login
ru: Войти

source: AI Media Library. All rights reserved.
ru: AI Медиатека. Все права защищены.

source: Project Settings
ru: Настройки проекта

source: AI Engines
ru: AI Движки

source: Prompts
ru: Промпты

source: Save Settings
ru: Сохранить настройки

source: Learning Dashboard
ru: Панель обучения

source: Track your progress and review materials.
ru: Отслеживайте прогресс и повторяйте изученное.

source: Spaced Repetition
ru: Интервальное повторение

source: You have <strong class="text-warning">%(count)s</strong> card due for review today.
ru: У вас <strong class="text-warning">%(count)s</strong> карточка для повторения сегодня.

source: Start Review
ru: Начать повторение

source: All Caught Up
ru: Всё повторено

source: Active Study Plans
ru: Активные учебные планы

source: Custom Plan
ru: Пользовательский план

source: Created
ru: Создано

source: %(completed)s / %(total)s units
ru: %(completed)s / %(total)s блоков

source: View Plan
ru: Смотреть план

source: No active study plans. Go to the Library to create one!
ru: Нет активных учебных планов. Создайте их в Библиотеке!

source: Recent Activity
ru: Недавняя активность

source: No recent activity.
ru: Нет активности.

source: Curriculum
ru: Программа

source: Done
ru: Готово

source: Start
ru: Начать

source: No units in this plan yet.
ru: В этом плане пока нет блоков.

source: Progress
ru: Прогресс

source: %(completed)s of %(total)s units completed
ru: Завершено %(completed)s из %(total)s блоков

source: Quiz
ru: Квиз

source: Passed!
ru: Сдано!

source: You scored %(score)s out of %(total)s (%(percent)s%%)
ru: Вы набрали %(score)s из %(total)s (%(percent)s%%)

source: Your Answer
ru: Ваш ответ

source: Correct Answer
ru: Правильный ответ

source: Explanation
ru: Пояснение

source: Retry Quiz
ru: Повторить квиз

source: Continue Learning
ru: Продолжить обучение

source: Back to Plan
ru: Назад к плану

source: Study Material
ru: Учебный материал

source: Submit Answers
ru: Отправить ответы

source: Session Complete
ru: Сессия завершена

source: Session Complete!
ru: Сессия завершена!

source: You've reviewed all your cards for today. Great job!
ru: Вы повторили все карточки на сегодня. Отличная работа!

source: Back to Dashboard
ru: Назад в дашборд

source: Study Session
ru: Сессия обучения

source: %(count)s cards remaining
ru: Осталось %(count)s карточек

source: Show Answer
ru: Показать ответ

source: How well did you know this?
ru: Насколько хорошо вы это знали?

source: Blackout
ru: Забыл

source: Again
ru: Снова

source: Hard
ru: Трудно

source: Good
ru: Хорошо

source: Perfect
ru: Идеально

source: Easy
ru: Легко

source: Exit Session
ru: Выйти из сессии

source: New Chat
ru: Новый чат

source: Recent Chats
ru: Недавние чаты

source: Select Topic
ru: Выбрать тему

source: General Chat
ru: Общий чат

source: Edit Title
ru: Изменить название

source: Are you sure you want to delete this chat?
ru: Вы уверены, что хотите удалить этот чат?

source: Delete Chat
ru: Удалить чат

source: Refresh Chat
ru: Обновить чат

source: Select Learning Context
ru: Выберите контекст обучения

source: No concepts studied recently.
ru: Нет недавно изученных концепций.

source: You
ru: Вы

source: Tutor
ru: Репетитор

source: Start a conversation with your AI Tutor!
ru: Начните разговор с вашим AI репетитором!

source: Tutor is thinking...
ru: Репетитор думает...

source: Ask a question...
ru: Задайте вопрос...

source: Chat History
ru: История чатов

source: Enter new chat title:
ru: Введите новое название чата:

source: Renaming not implemented yet.
ru: Переименование пока не реализовано.

source: Delete Media Item?
ru: Удалить медиафайл?

source: Are you sure you want to delete "<strong>%(title)s</strong>"?
ru: Вы уверены, что хотите удалить "<strong>%(title)s</strong>"?

source: This action cannot be undone.
ru: Это действие нельзя отменить.

source: Confirm Delete
ru: Подтвердить удаление

source: Cancel
ru: Отмена

source: Edit
ru: Редактировать

source: Delete
ru: Удалить

source: Type
ru: Тип

source: Date
ru: Дата

source: Download/View
ru: Скачать/Просмотреть

source: Transcription / Content
ru: Транскрипция / Контент

source: Media Library
ru: Медиатека

source: Upload New Media
ru: Загрузить новый медиафайл

source: Selected
ru: Выбрано

source: Restart AI analysis for selected items
ru: Перезапуск AI анализ для выбранных элементов

source: Re-analyze
ru: Переанализировать

source: Are you sure you want to delete selected items?
ru: Вы уверены, что хотите удалить выбранные элементы?

source: Permanently delete selected items
ru: Безвозвратно удалить выбранные элементы

source: Select items to perform actions
ru: Выберите элементы для действий

source: Actions
ru: Действия

source: No media items found. <a href="%(upload_url)s" class="text-primary">Upload one</a> to get started.
ru: Медиафайлы не найдены. <a href="%(upload_url)s" class="text-primary">Загрузите первый</a>, чтобы начать.

source: Delete Topic?
ru: Удалить тему?

source: Are you sure you want to delete the topic
ru: Вы уверены, что хотите удалить тему

source: Warning
ru: Обучение

source: Any sub-topics will also be deleted.
ru: Все подтемы также будут удалены.

source: Media items in this topic will NOT be deleted, but will become uncategorized.
ru: Медиафайлы в этой теме НЕ будут удалены, но станут без категории.

source: Edit Topic
ru: Редактировать тему

source: Create New Topic
ru: Создать новую тему

source: Optional
ru: Опционально

source: Select a parent topic to create a hierarchy.
ru: Выберите родительскую тему для создания иерархии.

source: Save Changes
ru: Сохранить изменения

source: Create Topic
ru: Создать тему

source: Manage Topics
ru: Управление темами

source: No topics found. <a href="%(create_url)s" class="text-primary">Create one</a> to get started.
ru: Темы не найдены. <a href="%(create_url)s" class="text-primary">Создайте первую</a> для начала.

source: Edit Media Item
ru: Редактировать медиафайл

source: Upload Media
ru: Загрузить медиа

source: Files (Select multiple)
ru: Файлы (можно несколько)

source: Upload
ru: Загрузить

source: Username
ru: Имя пользователя

source: Password
ru: Пароль

source: Learning Contexts
ru: Контексты обучения
